# Напишіть функцію, яка отримує два списки як параметр і повертає список,
# що містить елементи обох списків.

def merge_lists(list1, list2):

    # Об'єднуємо два списки за допомогою оператора + та зберігаємо результат в змінну merged_list
    merged_list = list1 + list2
    # Повертаємо об'єднаний список
    return merged_list

list1 = [1, 2, 3]  # Створюємо перший список
list2 = [4, 5, 6]  # Створюємо другий список
result = merge_lists(list1, list2)  # Викликаємо функцію merge_lists для об'єднання списків
print("Об'єднаний список:", result)  # Виводимо результат