# Написати рекурсивну функцію, яка виводить N зірок у ряд, число N задає користувач.
# Проілюструйте роботу функції прикладом. (Протестувати)

def print_stars(n):

    if n > 0:  # Якщо кількість зірок більше 0 друкуємо зірку та викликаємо функцію зі зменшенням кількості зірок
        print('*', end='')  # Друкуємо зірку без переходу на новий рядок
        print_stars(n - 1)  # Рекурсивний виклик функції зі зменшеним на одиницю значенням кількості зірок
    else:
        print()  # Перехід на новий рядок, коли кількість зірок дорівнює 0

# Приклад використання:
num_stars = int(input("Введіть кількість зірок: "))  # Запитуємо у користувача кількість зірок
print_stars(num_stars)  # Викликаємо функцію для виведення зірок