# Ваша функція is_even повинна повертати True якщо число парне, і False якщо число непарне.
# Вхідні дані: Ціле число.
# Вихідні дані: Логічний тип.

def is_even(digit):
    """
    Функція перевіряє, чи є число парним.
    Якщо число ділиться націло на 2 без залишку (digit % 2 == 0), то воно парне.
    У такому випадку функція повертає True.
    Якщо число не ділиться на 2 без залишку, то воно непарне, і функція повертає False.
    """
    return digit % 2 == 0

assert is_even(2) == True, 'Test1'
assert is_even(5) == False, 'Test2'
assert is_even(0) == True, 'Test3'
print('OK')