# Напишіть функцію для знаходження мінімуму у списку цілих. Список передається як параметр.
# Отриманий результат повертається із функції.

def find_minimum(lst):

    if not lst:  # Перевірка, чи список не пустий
        raise ValueError("Список порожній")  # Виняток, якщо список порожній

    min_value = lst[0]  # Припускаємо, що перший елемент - мінімальний

    for num in lst:  # Перебираємо кожен елемент у списку
        if num < min_value:  # Якщо поточний елемент менше припущеного мінімуму
            min_value = num  # Оновлюємо мінімальне значення

    return min_value  # Повертаємо знайдений мінімум

# Запитуємо у користувача введення трьох цифр (0 не допускається, максимальне значення - 9)
try:
    numbers = []  # Створюємо пустий список для збереження введених чисел
    for i in range(3):
        num = int(input(f"Введіть {i+1}-е число (від 1 до 9, без 0): "))
        if num <= 0 or num > 9:  # Перевіряємо чи число відповідає обмеженням
            raise ValueError("Число має бути від 1 до 9, без 0")  # Виняток, якщо число не відповідає обмеженням
        numbers.append(num)  # Додаємо введене число до списку введених чисел

    # Викликаємо функцію для знаходження мінімуму введених чисел
    minimum = find_minimum(numbers)
    print("Мінімальний елемент у списку:", minimum)

except ValueError as ve:
    print("Помилка:", ve)