# Напишіть функцію, яка видаляє зі списку ціле задане число.
# З функції потрібно повернути кількість видаленних елементів.

import random

def remove_element(nums, target):

    count = 0  # Ініціалізуємо лічильник видалених елементів

    # Проходимося по елементам списку у зворотньому порядку, щоб уникнути проблем із змінами розміру списку
    for i in range(len(nums) - 1, -1, -1):
        if nums[i] == target:  # Перевіряємо, чи поточний елемент дорівнює заданому числу
            nums.pop(i)  # Видаляємо елемент зі списку за індексом i
            count += 1  # Збільшуємо лічильник видалених елементів

    return count  # Повертаємо кількість видалених елементів

# Генеруємо випадковий список чисел від 1 до 10
random_list = [random.randint(1, 10) for _ in range(10)]

# Виводимо згенерований список чисел
print("Випадковий список чисел: ", random_list)

# Вказуємо число, яке потрібно видалити зі списку
target_number = 5

# Видаляємо задане число зі списку та виводимо кількість видалених елементів
deleted_count = remove_element(random_list, target_number)
print(f"Кількість видалених елементів з числом {target_number}: {deleted_count}")

# Виводимо оновлений список після видалення
print("Список після видалення: ", random_list)