# Напишіть функцію, яка обчислює ступінь кожного елемента списку цілих.
# Значення для ступеня передається як параметр, список також передається як параметр.
# Функція повертає новий список, який містить отримані результати.

def power_list(numbers, power):


    powered_numbers = []  # Створюємо пустий список для зберігання результатів піднесення до ступеня

    # Проходимося по кожному елементу у списку numbers
    for num in numbers:
        powered_numbers.append(num ** power)  # Підносимо кожен елемент до ступеня power та додаємо результат у список

    return powered_numbers  # Повертаємо список з результатами

# Приклад використання функції
my_numbers = [1, 2, 3, 4, 5]  # Вхідний список чисел
power = 3  # Ступінь до якого потрібно підняти кожен елемент
powered_result = power_list(my_numbers, power)  # Викликаємо функцію power_list
print("Результат піднесення до ступеня", power, ":", powered_result)  # Виводимо результат